--1. Напишете заявка, която извежда модел, честота и размер на диска за всички персонални компютри с цена под 1200 долара. Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB
select model, speed as 'MHz', hd as 'GB'
from pc
where price < 1200;

--2. Напишете заявка, която извежда производителите на принтери без повторения
select distinct maker
from product
where type='printer';

--3. Напишете заявка, която извежда модел, размер на паметта, размер на екран за лаптопите, чиято цена е над 1000 долара
select model, ram, screen
from laptop
where price>1000;

--4. Напишете заявка, която извежда всички цветни принтери
select *
from printer
where color='y';

--5. Напишете заявка, която извежда модел, честота и размер на диска за тези персонални компютри със CD 12x или 16x и цена под 2000 долара.
select model, speed, hd
from pc
where (cd = '12x' or cd = '16x') and price<2000;
