--1. Напишете заявка, която извежда класа и страната за всички класове с помалко от 10 оръдия.
select class, country
from classes
where numguns<10;

--2. Напишете заявка, която извежда имената на корабите, пуснати на вода преди 1918. Задайте псевдоним shipName на колоната.
select name
from ships
where launched <1918;

--3. Напишете заявка, която извежда имената на корабите потънали в битка и имената на съответните битки.
select ship, battle
from outcomes
where result='sunk';

--4. Напишете заявка, която извежда имената на корабите с име, съвпадащо с името на техния клас.
select name
from ships
where name=class;

--5. Напишете заявка, която извежда имената на корабите, които започват с буквата R.
select name
from ships
where name like 'R%';

--6. Напишете заявка, която извежда имената на корабите, които съдържат 2 или повече думи
select name
from ships
where name like '_% _%';